app/controllers/movies_controller.rb

  def search
    @text = params[:q] || ""

    @header =(t "search.search")+ ": " + @text
    @title = @header + " / Twilike"

    movie_condition = ["UPPER(names) LIKE UPPER(?)", "%#{@text}%"]
    user_condition = ["UPPER(name) LIKE UPPER(?) OR UPPER(screen_name) LIKE UPPER(?)", "%#{@text}%", "%#{@text}%"]

    @movies_count = Movie.count(:conditions => movie_condition)
    @users_count = User.count(:conditions => user_condition)

    @type = "movie"
    @type = "user" if params[:target] == "user"

    if @type == "movie"
      @movies = Movie.paginate(:conditions => movie_condition,
                               :per_page => MOVIES_COUNT,
                               :page => params[:page])
    else
      @users = User.paginate(:conditions => user_condition,
                             :per_page => USERS_COUNT,
                             :page => params[:page])
---
SELECT count(*) AS count_all FROM `movies` WHERE (UPPER(names) LIKE UPPER('%Jx%'))
SELECT count(*) AS count_all FROM `users` WHERE (UPPER(name) LIKE UPPER('%Jx%') OR UPPER(screen_name) LIKE UPPER('%Jx%'))
SELECT * FROM `movies` WHERE (UPPER(names) LIKE UPPER('%Jx%')) LIMIT 0, 12
SELECT * FROM `users` WHERE (UPPER(name) LIKE UPPER('%%') OR UPPER(screen_name) LIKE UPPER('%%')) LIMIT 0, 7