app/controllers/opinions_controller.rb

SELECT * FROM `movies` WHERE (`movies`.`small_name` = 'forrest-gump') LIMIT 1
SELECT * FROM `opinions` WHERE (`opinions`.`movie_id` = 24) ORDER BY created_at DESC LIMIT 0, 9
---
  def by_movie
    return if caching(1.minute, params[:small_name], params[:page])

    @movie = Movie.find_by_small_name(params[:small_name])

    if @movie != nil
      get_header_and_title_from_i18n
      @header = @movie.translated_name
      @title = @movie.translated_name + " / Twilike"

      @opinions = Opinion.paginate(:conditions => { :movie_id => @movie },
                                   :per_page => MOVIE_COUNT,
                                   :page => params[:page])

SELECT * FROM `opinions` WHERE (`opinions`.`rating` = -1) ORDER BY created_at DESC LIMIT 5
---
  def timeline
    return if caching(1.minute)

    get_header_and_title_from_i18n

    @timelines = {}

    [[:plus, 1], [:minus, -1], [:neutral, 0]].each do |rate|
      @timelines[rate[0]] = Opinion.all(:limit => TIMELINE_COUNT,
                                        :conditions => { :rating => rate[1] })

SELECT * FROM `users` WHERE (`users`.`screen_name` = 'vagav') LIMIT 1
SELECT * FROM `opinions` WHERE (`opinions`.`user_id` = 60) ORDER BY created_at DESC LIMIT 0, 9
---
  def by_user
    # getting view
    @view = nil
    USER_VIEWS.each { |view| @view = view if params[:view] == view }

    # redirect if view = nil
    if @view == nil
      # get default view from cookies
      new_view = 'block' # default view
      USER_VIEWS.each { |view| new_view = view if cookies[:view] == view }

      head :moved_permanently,
           :location => user_movies_url(:screen_name => params[:screen_name], :page => params[:page], :view => new_view)

      return
    end

    # set current view as default
    cookies[:view] = { :value => @view, :expires => 1.year.from_now, :domain => "."+RAILS_DOMAIN }

    # it's all true
    return if caching(3.minutes, params[:screen_name], params[:page], @view)

    @user = User.first(:conditions => { :screen_name => params[:screen_name] })

    if @user != nil
      get_header_and_title_from_i18n
      @header = @user.name
      @title = @user.name + " / Twilike"

      @opinions = Opinion.paginate(:conditions => { :user_id => @user },
                                   :per_page => USER_COUNT,
                                   :page => params[:page])

SELECT * FROM `opinions` WHERE (`opinions`.`tweet_id` = '4689017865') ORDER BY created_at DESC LIMIT 1
---
  def one
    @opinion = Opinion.find_by_tweet_id(params[:tweet_id])